app/controllers/entries_controller.rb

INSERT INTO "entries" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 18 May 2013 06:34:14 UTC +00:00], ["name", "hi"], ["updated_at", Sat, 18 May 2013 06:34:14 UTC +00:00]]
SELECT "entries".* FROM "entries"
---
  def sign_in
   @name = params[:visitor_name]
   unless @name.blank?
    @entry = Entry.create({:name=> @name})

   end
    @entries= Entry.all